"""Дано целое положительное число, ваша задача вывести разряд сотен этого числа"""

x=int(input())
a=x//100%10
print(a)